In [1]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

In [2]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name, 
            user = user_name,
            password = user_password
            )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")
    return connection
# MySql workbech password
pw = "12345678"
# Database name
db = 'mysql_python'
connection = create_server_connection("localhost", "root", pw)

MySQL Database connection successful

In [3]:
# Creating mysql_python database

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print("Database created successfully")
    except Error as err:
        print(f"Error: '{err}'")
create_database_query = "Create database mysql_python"
create_database(connection, create_database_query)

Error: '1007 (HY000): Can't create database 'mysql_python'; database exists'

In [4]:
# Connect to database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host = host_name,
            user = user_name,
            password = user_password,
            db = db_name  
        )
        print("MySQL database connection successful")
    except Error as err:
        print(f"Error:'{err}'")
    return connection

In [5]:
# Execute SQL queries 

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query was successful")
    except Error as err:
        print(f"Error:'{err}'")

In [6]:
create_orders_table = """create table orders(
order_ID int primary key, 
customer_name varchar(30) NOT NULL, 
product_name varchar(20) NOT NULL,
order_date date, 
quantity int, 
unit_price float, 
Phone_number varchar(20)
);"""

# connect to the database

connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successful
Error:'1050 (42S01): Table 'orders' already exists'

In [7]:
# Insert Data into table 

order_data = """
insert into orders values
(101, 'Steve', 'Laptop', '2018-06-12', 2, 800, '5782930920'),
(102, 'Jobs', 'Books', '2019-03-08', 10, 23, '1204809823'),
(103, 'Stacy', 'Pants', '2019-05-29', 5, 50, '8492394802'),
(104, 'Nancy', 'T-Shirt', '2018-01-17', 7, 30, '3402984592'),
(105, 'Maria', 'Headphones', '2019-07-30', 6, 48, '1238091824'),
(106, 'Danny', 'Smart TV', '2018-04-21', 10, 300, '4239842022');
"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, order_data)

MySQL database connection successful
Error:'1062 (23000): Duplicate entry '101' for key 'orders.PRIMARY''

In [8]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error:'{err}'")

In [9]:
# Using SELECT statement

q1= """select * from orders;"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '5782930920')
(102, 'Jobs', 'Books', datetime.date(2019, 3, 8), 10, 23.0, '1204809823')
(103, 'Stacy', 'Pants', datetime.date(2019, 5, 29), 5, 45.0, '8492394802')
(104, 'Nancy', 'T-Shirt', datetime.date(2018, 1, 17), 7, 30.0, '3402984592')
(106, 'Danny', 'Smart TV', datetime.date(2018, 4, 21), 10, 300.0, '4239842022')

In [10]:
q2 = """select customer_name, phone_number from orders;"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySQL database connection successful
('Steve', '5782930920')
('Jobs', '1204809823')
('Stacy', '8492394802')
('Nancy', '3402984592')
('Danny', '4239842022')

In [11]:
q3 = """select year(order_date) from orders;"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

MySQL database connection successful
(2018,)
(2019,)
(2019,)
(2018,)
(2018,)

In [12]:
q4 = """select distinct year(order_date) from orders;"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySQL database connection successful
(2018,)
(2019,)

In [13]:
q5 = """select * from orders where order_date < '2018-12-31';"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '5782930920')
(104, 'Nancy', 'T-Shirt', datetime.date(2018, 1, 17), 7, 30.0, '3402984592')
(106, 'Danny', 'Smart TV', datetime.date(2018, 4, 21), 10, 300.0, '4239842022')

In [14]:
q6 = """select * from orders where order_date > '2018-12-31';"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySQL database connection successful
(102, 'Jobs', 'Books', datetime.date(2019, 3, 8), 10, 23.0, '1204809823')
(103, 'Stacy', 'Pants', datetime.date(2019, 5, 29), 5, 45.0, '8492394802')

In [15]:
q7 = """select * from orders order by unit_price desc;"""
connection = create_db_connection("localhost", "root", pw, db)
results = read_query(connection, q7)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '5782930920')
(106, 'Danny', 'Smart TV', datetime.date(2018, 4, 21), 10, 300.0, '4239842022')
(103, 'Stacy', 'Pants', datetime.date(2019, 5, 29), 5, 45.0, '8492394802')
(104, 'Nancy', 'T-Shirt', datetime.date(2018, 1, 17), 7, 30.0, '3402984592')
(102, 'Jobs', 'Books', datetime.date(2019, 3, 8), 10, 23.0, '1204809823')

In [16]:
from_db = []
for result in results:
    result = list(result)
    from_db.append(result)
col = ['order_ID', 'customer_name', 'product_name', 'order_date', 'quantity', 'unit_price', 'Phone_number']
df = pd.DataFrame(from_db, columns=col)
df

,order_ID,customer_name,product_name,order_date,quantity,unit_price,Phone_number
0,101,Steve,Laptop,2018-06-12,2,800.0,5782930920
1,106,Danny,Smart TV,2018-04-21,10,300.0,4239842022
2,103,Stacy,Pants,2019-05-29,5,45.0,8492394802
3,104,Nancy,T-Shirt,2018-01-17,7,30.0,3402984592
4,102,Jobs,Books,2019-03-08,10,23.0,1204809823

In [17]:
# Update command

update_order = """update orders set unit_price = 45 where order_ID = 103;"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, update_order)

MySQL database connection successful
Query was successful

In [18]:
# Delete command

delete_order = """ delete from orders where order_ID = 105;"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, delete_order)

MySQL database connection successful
Query was successful

In [19]:
q8 = """select * from orders where length('Phone_number') = 10"""
connection = create_db_connection("localhost", "root", pw, db)
execute_query(connection, q8)

MySQL database connection successful
Error:'Unread result found'